## Valores faltantes y no deseados

### 1. Librerías y carga de datos

In [11]:
import pandas as pd
import numpy as np

In [12]:
dataset = pd.DataFrame({'A': [1,2,3, pd.NA,np.NaN],
                        'B': [4,2,324, pd.NA,''],
                        'C': [pd.NA,2,3, pd.NA,8]})
dataset.head()

      A     B     C
0     1     4  <NA>
1     2     2     2
2     3   324     3
3  <NA>  <NA>  <NA>
4   NaN           8

### 2. Detección de valores faltantes

Los valores nulos se detectan como NA. La función isnull() es igual a isna()

In [17]:
dataset.isnull()

       A      B      C
0  False  False   True
1  False  False  False
2  False  False  False
3   True   True   True
4   True  False  False

In [20]:
dataset.isna()

       A      B      C
0  False  False   True
1  False  False  False
2  False  False  False
3   True   True   True
4   True  False  False

In [30]:
# Cantidad de valores faltantes por columna
dataset.isnull().sum()

A    2
B    1
C    2
dtype: int64

In [32]:
# Valores faltantes en todo el dataset
dataset.isnull().sum().sum()

5

In [38]:
# Comprobar si existen valores vacíos en el dataset
dataset.isnull().values.any()

True

In [41]:
# Valores no vacíos
dataset.notnull()

       A      B      C
0   True   True  False
1   True   True   True
2   True   True   True
3  False  False  False
4  False   True   True

In [43]:
dataset.notnull().sum()

A    3
B    4
C    3
dtype: int64

In [45]:
dataset.notnull().sum().sum()

10

In [49]:
dataset.notnull().values.any()

True

**Filtrar valores vacíos en un Dataframe**

In [52]:
dataset.head()

      A     B     C
0     1     4  <NA>
1     2     2     2
2     3   324     3
3  <NA>  <NA>  <NA>
4   NaN           8

In [55]:
dataset.loc[dataset['A'].isnull()]

      A     B     C
3  <NA>  <NA>  <NA>
4   NaN           8

In [63]:
dataset['A'].isnull().sum()

2

**Filtrar valores NO vacíos en un Dataframe**

In [57]:
dataset.loc[~dataset['A'].isnull()]

   A    B     C
0  1    4  <NA>
1  2    2     2
2  3  324     3

In [58]:
dataset.loc[dataset['A'].notnull()]

   A    B     C
0  1    4  <NA>
1  2    2     2
2  3  324     3